[
    {
      "note": "In Poland, cryptocurrencies are considered virtual currencies and are subject to taxation under the Personal Income Tax (PIT) and Corporate Income Tax (CIT) laws."
    },
    {
      "note": "Profits from cryptocurrency transactions are taxed at a flat rate of 19% as income from capital gains for individuals and as corporate income for businesses."
    },
    {
      "note": "Taxable events include exchanging virtual currency for legal tender, exchanging virtual currency for goods, services, or property rights, and settling liabilities with virtual currency."
    },
    {
      "note": "Exchanging one cryptocurrency for another is not considered a taxable event in Poland."
    },
    {
      "note": "Losses from cryptocurrency investments can be deducted and carried forward to offset future gains, provided they are properly documented."
    },
    {
      "note": "Income from cryptocurrency mining is considered revenue from business activity and is subject to taxation under standard PIT or CIT rates."
    },
    {
      "note": "Polish taxpayers are required to report their cryptocurrency gains and losses in their annual tax returns, maintaining detailed records of all transactions."
    },
    {
      "note": "The Polish government has implemented Anti-Money Laundering (AML) regulations that apply to entities providing services related to virtual currencies, such as exchanges and wallet providers."
    },
    {
      "note": "As of December 2024, a draft law proposes significant changes to the crypto-assets market, including the introduction of a Crypto-Asset Service Provider (CASP) license and the abolition of the existing Virtual Asset Service Provider (VASP) register."
    },
    {
      "note": "The proposed law also includes a ban on lending in crypto-assets or brokering loan transactions involving crypto-assets."
    },
    {
      "note": "The draft law shortens the transition period for compliance, requiring entities to obtain a CASP license by September 30, 2025, to continue operations."
    },
    {
      "note": "It's essential for investors and businesses to stay informed about the evolving tax regulations and proposed legislative changes in Poland to ensure accurate reporting and compliance with the law."
    }
  ]
  