[
    {
        "note": "In Romania, cryptocurrencies are considered taxable assets, and profits from crypto are subject to Income Tax."
    },
    {
        "note": "A flat Income Tax rate of 10% applies to any capital gains or additional income from cryptocurrency activities if total earnings throughout the financial year exceed 600 lei."
    },
    {
        "note": "As of November 2024, the Romanian Parliament has amended the guidance to exempt gains from crypto for natural persons until July 31, 2025."
    },
    {
        "note": "Taxable events include selling crypto for fiat currency, trading one cryptocurrency for another, and using crypto to purchase goods or services."
    },
    {
        "note": "Purchasing cryptocurrencies with fiat currency, holding cryptocurrencies, and transferring them between personal wallets are non-taxable events."
    },
    {
        "note": "The Agenția Națională de Administrare Fiscală (ANAF) has not provided detailed guidance on the taxation of specific crypto activities such as mining, staking, or DeFi transactions; consulting a tax professional is advisable in such cases."
    },
    {
        "note": "Taxpayers are required to report their cryptocurrency gains and losses in their annual tax returns, maintaining detailed records of all transactions."
    },
    {
        "note": "The deadline for tax returns in Romania is May 25 each year, covering the previous financial year from January 1 to December 31."
    },
    {
        "note": "The ANAF has the authority to track cryptocurrency transactions and holdings, especially under EU directives on data sharing and anti-money laundering."
    },
    {
        "note": "Penalties for failing to report cryptocurrency income can include fines, interest on unpaid taxes, and in severe cases, imprisonment."
    },
    {
        "note": "It's essential for investors to stay informed about the evolving tax regulations in Romania to ensure accurate reporting and compliance with the law."
    }
]
