[
    {
        "note": "In Spain, cryptocurrencies are considered capital assets and are subject to taxation by the Agencia Tributaria."
    },
    {
        "note": "Capital gains from selling, swapping, or spending cryptocurrencies are classified as savings income and are taxed at rates ranging from 19% to 28%, depending on the amount of gain."
    },
    {
        "note": "Income from cryptocurrency mining is treated as a freelance business activity and is subject to Income Tax rates up to 47%, depending on total income."
    },
    {
        "note": "Staking rewards are viewed as investment income and are taxed between 19% to 28%, depending on the amount of income."
    },
    {
        "note": "Taxable events include selling crypto for fiat currency, trading one cryptocurrency for another, and using crypto to purchase goods or services."
    },
    {
        "note": "Purchasing cryptocurrencies with fiat currency, holding cryptocurrencies, and transferring them between personal wallets are non-taxable events."
    },
    {
        "note": "Spain uses the FIFO (First In, First Out) method for calculating the cost basis of cryptocurrencies."
    },
    {
        "note": "Losses from cryptocurrency transactions can be offset against gains in the same financial year and can be carried forward for up to four years."
    },
    {
        "note": "Residents with worldwide assets exceeding €700,000, including cryptocurrencies, may be subject to Wealth Tax, with rates varying by region."
    },
    {
        "note": "Taxpayers are required to report their cryptocurrency gains and losses in their annual tax returns using Form 100 (Modelo 100), maintaining detailed records of all transactions."
    },
    {
        "note": "The deadline for tax returns in Spain is June 30 each year, covering the previous financial year from January 1 to December 31."
    },
    {
        "note": "Spanish residents must report cryptocurrency holdings over €50,000 held abroad using Model 721."
    },
    {
        "note": "The Agencia Tributaria has the authority to track cryptocurrency transactions and holdings, especially under EU directives on data sharing and anti-money laundering."
    },
    {
        "note": "Penalties for failing to report cryptocurrency income can include fines, interest on unpaid taxes, and in severe cases, imprisonment."
    },
    {
        "note": "It's essential for investors to stay informed about the evolving tax regulations in Spain to ensure accurate reporting and compliance with the law."
    }
]
